app/controllers/admin/brands_controller.rb

SELECT  "brands".* FROM "brands" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @brands = Brand.get_all.page(params[:page])