app/controllers/admin/categories_controller.rb

  def index
    @categories = Category.get_all.page(params[:page])
---
SELECT  "categories".* FROM "categories" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]