app/controllers/admin/pages_controller.rb

SELECT  "pages".* FROM "pages" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "pages"
---
  def index
    @pages = Page.get_all.page(params[:page])