app/controllers/admin/posts_controller.rb

  def index
    @posts = Post.get_all.page(params[:page])
---
SELECT  "posts".* FROM "posts" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"