app/controllers/admin/price_requests_controller.rb

  def index
    @price_requests = PriceRequest.get_all.page(params[:page])
---
SELECT  "price_requests".* FROM "price_requests" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "price_requests"