app/controllers/admin/products_controller.rb

SELECT  "products".* FROM "products" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.get_all.page(params[:page])