app/views/shared/_top_nav.html.haml

SELECT COUNT(*) FROM "cart_items" WHERE "cart_items"."user_id" = $1  [["user_id", 1]]
---
        %li
          = link_to "#{current_user.cart_items.count}", cart_items_path, class:"page-scroll fa fa-shopping-cart cart", "data-target" => "#cartModal", "data-toggle" => "modal", remote: true if current_user