app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 ORDER BY "orders"."created_at" DESC  [["user_id", 1]]
---
  def index
    @orders = current_user.orders.desc